modules/admin/controllers/CategoryController.php

SELECT * FROM `tbl_category` WHERE `id`='8'
---
    public function actionGetInfo(){
        $id = \Yii::$app->request->post('id');
        $result = Category::find()->asArray()->where(['id'=>$id])->one();