modules/admin/controllers/MenuController.php

INSERT INTO `tbl_menu` (`modify_time`, `create_time`, `parentid`, `name`, `alias_name`, `action`, `method`, `icon`, `listorder`, `focus`, `active`) VALUES ('2017-02-08 09:31:32', '2017-02-08 09:31:32', 76, '推荐位管理', 'recommend_manage', 'recommend', 'list', 'menu-icon fa fa-caret-right', 0, 'article', 'article_recommend')
---
    public function actionDoadd()
    {
        $menu = new models\TblMenu();

        $menu->create_time = $menu->modify_time = date("Y-m-d H:i:s");
        $menu->setAttributes(\Yii::$app->request->post());

        $status = 0;
        $msg = "";

        if ($menu->validate() && $menu->save(false)) {