modules/admin/controllers/OperatorController.php

SELECT * FROM `tbl_role` WHERE `is_valid`=1 ORDER BY `sort_by` DESC
---
    public function actionList(){
        $this->initFocus('sys', 'sys_operator');
        parent::init();

        $model = new models\TblRole();
        $roles = $model->find()->where(['is_valid'=>1])->orderBy("sort_by desc")->all();

SELECT * FROM `tbl_operator` WHERE `id`='1'
---
    public function actionGetInfo(){
        $id = \Yii::$app->request->post('id');
        $result = models\Operator::find()->asArray()->where(['id'=>$id])->one();