modules/admin/controllers/PublicController.php

    public function actionDologin(){
        $request  = \Yii::$app->request;
        $username = $request->post('username');
        $password = $request->post('password');

        if(empty($username) || empty($password)){
            echo json_encode(array('status'=>2,'message'=>'非法操作!'));
            exit;
        }

        $query =  Operator::find()->where(['name'=>$username]);
        $operator = $query->one();
        $logSql = $query->createCommand()->getRawSql();

        if(empty($operator)){
            echo json_encode(array('status'=>2,'message'=>'操作员不存在!'));
            exit;
        }else{
            if ($operator->password != md5($password)){
                echo json_encode(array('status'=>2,'message'=>'密码错误!'));
                exit;
            }

            if($operator->is_valid==0){
                echo json_encode(array('status'=>2,'message'=>'操作员被禁用!'));
                exit;
            }

            $login_token = md5(Util::toString());
            $operator->login_token = $login_token;
            $operator->save(false);
---
SELECT * FROM `tbl_operator` WHERE `name`='admin'
UPDATE `tbl_operator` SET `login_token`='6995d66e25946f432edb4fa4c34d5c64' WHERE `id`='1'