modules/admin/controllers/RoleController.php

  public function actionGetRightlists(){
      $model = new models\TblMenu();
      $roleid = \Yii::$app->request->get('id');
      $rightArr = array();

      $roleright = new models\TblRoleright();
      $rs = $roleright->findOne(['role_id'=>$roleid]);
---
SELECT * FROM `tbl_roleright` WHERE `role_id`='10'