models/TblMenu.php

SELECT COUNT(*) FROM `tbl_menu` WHERE `parentid`='1'
---
    public function getMenuTree($id,$rightids){
        $menus = $this->find()
                      ->where(['parentid'=>$id])->orderBy("listorder desc")->asArray()->all();
        $json_data = array();
        foreach ($menus as $rs):
            $id = $rs['id'];
            $cnt = $this->find()
                        ->where(['parentid'=>$id])->count();

SELECT COUNT(*) FROM `tbl_menu` WHERE `parentid`='3'
---
    public function getChildTrees($pid,$rightids){
        $data = array();
        $menus = $this->find()
                      ->where(['parentid'=>$pid])->orderBy("listorder desc")->asArray()->all();
        foreach ($menus as $rs):
            $id = $rs['id'];
            $cnt = $this->find()
                        ->where(['parentid'=>$id])->count();